app/Controllers/Inicio.php

    public function index()
    {
        if(!isset($this->session->id_usuario)){
            return redirect()->to(base_url());
        }
        $activo=$this->usuario->where('id',$this->session->id_usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `id` = '3'
 LIMIT 1