app/Controllers/Productos.php

    public function index($activo = 1)
    {
        $permiso = $this->detallesRoles->verficaPermiso($this->session->id_rol, 'ProductosCatalogo');
        if (!$permiso) {
            //echo 'No tiene permiso';
            //exit;
            echo view('alertaUsuario');
            exit;
        }
        $productos = $this->productos->where('activo', $activo)->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 1

    public function autocompleteData()
    {
        $returnData = array();
        $valor = $this->request->getGet('term');

        $productos = $this->productos->like('codigo', $valor)->where('activo', 1)->findAll();
---
SELECT *
FROM `productos`
WHERE `codigo` LIKE '%234%' ESCAPE '!'
AND `activo` = 1