app/Controllers/Roles.php

    public function index($activo = 1)
    {
        $roles = $this->roles->where('activo', $activo)->findAll();
---
SELECT *
FROM `roles`
WHERE `activo` = 1

    public function detalles($idRol)
    {


        $permisos = $this->permisos->findAll();
---
SELECT *
FROM `permisos`