app/Controllers/TemporalCompra.php

SELECT *
FROM `productos`
WHERE `id` = '10'
 LIMIT 1
---
    public function insertar_venta($id_producto,$cantidad,$id_venta)
    {
        $error='';

        $producto=$this->productos->where('id',$id_producto)->first();