app/Controllers/Ventas.php

SELECT *
FROM `cajas`
WHERE `id` = '2'
 LIMIT 1
UPDATE `cajas` SET `folio` = 27, `fecha_edit` = '2023-01-04 16:49:41'
WHERE `cajas`.`id` IN ('2')
INSERT INTO `detalle_venta` (`id_venta`, `id_producto`, `nombre`, `cantidad`, `precio`, `fecha_alta`) VALUES (47, '13', 'Gaseosa IncaKola', '1', '8.50', '2023-01-04 16:49:41')
---
    public function guarda()
    {

        $id_venta = $this->request->getPost('id_venta');
        $total = preg_replace('/[\$,]/', '', $this->request->getPost('total'));
        $forma_pago = $this->request->getPost('forma_pago');
        $id_cliente = $this->request->getPost('id_cliente');

        $caja=$this->cajas->where('id',$this->session->id_caja)->first();
        $folio=$caja['folio'];

        $day=date('w',strtotime(date('Y-m-d')));
        $week=date('W',strtotime(date('Y-m-d')));
        $date=$week.$day;
        $resultadoId = $this->ventas->insertaVenta($folio, $total, $this->session->id_usuario, $this->session->id_caja, $id_cliente, $forma_pago,$date);
        $this->temporal_compra = new TemporalCompraModel();

        if ($resultadoId) {
            $folio++;
            $this->cajas->update($this->session->id_caja,['folio'=>$folio]);
            $resultadoVenta = $this->temporal_compra->porCompra($id_venta);
            foreach ($resultadoVenta as $row) {
                $this->detalle_venta->save([
                    'id_venta' => $resultadoId,
                    'id_producto' => $row['id_producto'],
                    'nombre' => $row['nombre'],
                    'cantidad' => $row['cantidad'],
                    'precio' => $row['precio']
                ]);

SELECT *
FROM `ventas`
WHERE `id` = '47'
 LIMIT 1
SELECT *
FROM `detalle_venta`
WHERE `id_venta` = '47'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'tienda_nombre'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'tienda_direccion'
SELECT `valor`
FROM `configuracion`
WHERE `nombre` = 'ticket_leyenda'
---
    function generaTicket($id_venta)
    {
        $datosVenta = $this->ventas->where('id', $id_venta)->first();
        $detalleVenta = $this->detalle_venta->select('*')->where('id_venta', $id_venta)->findAll();
        $nombreTienda = $this->configuracion->select('valor')->where('nombre', 'tienda_nombre')->get()->getRow()->valor;
        $direccionTienda = $this->configuracion->select('valor')->where('nombre', 'tienda_direccion')->get()->getRow()->valor;
        $leyendaTicket = $this->configuracion->select('valor')->where('nombre', 'ticket_leyenda')->get()->getRow()->valor;