app/Models/ProductosModel.php

UPDATE `productos` SET `existencias` = existencias - 1
WHERE `id` = '13'
---
    public function actualizaStock($id_producto, $cantidad, $operador = '+')
    {
        $this->set('existencias', "existencias $operador $cantidad", FALSE);
        $this->where('id', $id_producto);
        $this->update();

SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `activo` = 1
---
    public function totalProductos()
    {
        return $this->where('activo', 1)->countAllResults();

SELECT *
FROM `productos`
WHERE `stock_minimo` >= existencias AND `inventariable` = 1 AND `activo` = 1
---
    public function getProductosMinimo()
    {
        $where = "stock_minimo>=existencias AND inventariable=1 AND activo=1";
        return $this->where($where)->findAll();