app/Models/VentasModel.php

    public function numVentas($fecha){
        $where="activo = 1 AND DATE(fecha_alta)='$fecha'";
        return $this->where($where)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE `activo` = 1 AND DATE(fecha_alta) = '2022-12-19'