app/Models/VentasModel.php

INSERT INTO `ventas` (`folio`, `total`, `id_usuario`, `id_caja`, `id_cliente`, `forma_pago`, `venta_dia`, `fecha_alta`) VALUES ('26', '9.50', '3', '2', '1', '001', '013', '2023-01-04 16:49:41')
---
    public function insertaVenta($id_venta,$total,$id_usuario,$id_caja,$id_cliente,$forma_pago,$venta_dia){
        $this->insert([
            'folio'=>$id_venta,
            'total'=>$total,
            'id_usuario'=>$id_usuario,
            'id_caja'=>$id_caja,
            'id_cliente'=>$id_cliente,
            'forma_pago'=>$forma_pago,
            'venta_dia'=>$venta_dia
        ]);

SELECT sum(total) AS total
FROM `ventas`
WHERE `activo` = 1 AND DATE(fecha_alta) = '2023-01-04'
 LIMIT 1
---
    public function totalDia($fecha){
        $this->select("sum(total) AS total");
        $where="activo = 1 AND DATE(fecha_alta)='$fecha'";
        return $this->where($where)->first();

SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE `activo` = 1 AND `venta_dia` = '011'
SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE `activo` = 1 AND `venta_dia` = '012'
SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE `activo` = 1 AND `venta_dia` = '013'
SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE `activo` = 1 AND `venta_dia` = '014'
SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE `activo` = 1 AND `venta_dia` = '015'
SELECT COUNT(*) AS `numrows`
FROM `ventas`
WHERE `activo` = 1 AND `venta_dia` = '016'
---
    public function numVentas($week){

        $results=array();
        $a=0;
        $week_d=$week.$a;
        var_dump($week_d);
        $where_d="activo = 1 AND venta_dia='$week_d'"; $a++;
        $week_l=$week.$a;
        $where_l="activo = 1 AND venta_dia='$week_l'"; $a++;
        $week_ma=$week.$a;
        $where_ma="activo = 1 AND venta_dia='$week_ma'"; $a++;
        $week_mi=$week.$a;
        $where_mi="activo = 1 AND venta_dia='$week_mi'"; $a++;
        $week_j=$week.$a;
        $where_j="activo = 1 AND venta_dia='$week_j'"; $a++;
        $week_v=$week.$a;
        $where_v="activo = 1 AND venta_dia='$week_v'"; $a++;
        $week_s=$week.$a;
        $where_s="activo = 1 AND venta_dia='$week_s'";
        $results=[
            'ventasDo'=>$this->where($where_d)->countAllResults(),
            'ventasLu'=>$this->where($where_l)->countAllResults(),
            'ventasMar'=>$this->where($where_ma)->countAllResults(),
            'ventasMie'=>$this->where($where_mi)->countAllResults(),
            'ventasJu'=>$this->where($where_j)->countAllResults(),
            'ventasVi'=>$this->where($where_v)->countAllResults(),
            'ventasSa'=>$this->where($where_s)->countAllResults()